content/daily/2022-03-26.md
+++
title = "2022-03-26"
author = ["System Administrator"]
tags = ["draft", "draft"]
draft = false
+++

## completing the atom habit {#completing-the-atom-habit}


## THREAD Habits <span class="tag"><span class="agenda">agenda</span></span> {#thread-habits}

1 good habit more every day
The habits could be found the node following [Atom habits]({{< relref "2022-03-25.md#atom-habits" >}})
It would take probably a month to finish the list.


### <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-26 Sat&gt; </span></span> Coding {#coding}

relevent in [coding machine]({{< relref "../main/20220326155217-coding_machine.md" >}}) and [Engineer]({{< relref "../main/20211102001428-engineer.md" >}})'s coding node.


### <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-26 Sat&gt; </span></span> Read Don Quijote {#read-don-quijote}


### <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-03-27 Sun&gt; </span></span> Running {#running}


#### Cue - Obvious {#cue-obvious}

I will Go running at 8 a.m. beside the river.


#### Attractive {#attractive}

<!--list-separator-->

-  Temptation bundling

    Take my favourite podcast/jazz with me.

<!--list-separator-->

-  primitive motive

    To have a very sound mind/body

<!--list-separator-->

-  Benefits

    1.  To become stronger
    2.  Sound mind
    3.  feeling the body
    4.  loose weight and be fit
    5.  run faster
    6.  sing with better breath


#### Easy {#easy}

<!--list-separator-->

-  Reducing Friction

    I will have my clothes ready at bed.

<!--list-separator-->

-  2-minute

    Just, run for a song/2 minute, and then decide to go back or carry on.


#### satisfying {#satisfying}

<!--list-separator-->

-  Track

    org-habit

<!--list-separator-->

-  visual measurement

    log of where I have been to, what I have seen, what I have listened.
    how long this time it lasts
    maybe use the memory techniques.